app/controllers/admin/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def remove_user
    @team = Team.find(params[:team_id])