app/views/credentials/_form.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "team_memberships" ON "teams"."id" = "team_memberships"."team_id" WHERE "team_memberships"."user_id" = $1  [["user_id", 3]]
---
    <!-- only shows current user teams -->
    <%= form.select :team_id, @user.teams.map { |e| [e.name, e.id] } %>