app/controllers/credentials_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "credentials".* FROM "credentials" WHERE "credentials"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])
    filter_current_user(@user)

    @page_libs = [:openpgp, :pgpKeyDecrypt]
    @credential = Credential.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"
SELECT "credentials".* FROM "credentials" WHERE "credentials"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    # if user has no gpg key, redirect to user_credentials_path with error.
    user = User.find(params[:user_id])
    if user.gpg_key_id == nil
      redirect_to user_credentials_url(user), notice: "User has no gpg Key defined yet."
      return
    end

    team = Team.find(params[:credential][:team_id])

    team.users.each do |member|

DELETE FROM "credentials" WHERE "credentials"."id" = $1  [["id", 3]]
---
  def destroy
    @user = params[:user_id]
    @credential.destroy!

SELECT "credentials".* FROM "credentials" WHERE "credentials"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_credential
      @credential = Credential.find(params[:id])