app/controllers/credentials_controller.rb

SELECT "teams".* FROM "teams"
---
  def create
    @credential = Credential.new(credential_params)
    @user = User.find(params[:user_id])
    @credential.owner = User.find(params[:user_id])
    @teamArr = Team.all.to_a

DELETE FROM "credentials" WHERE "credentials"."id" = $1  [["id", 3]]
---
  def destroy
    @credential.destroy!