app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @user = User.find(params[:user_id])
---
SELECT "teams".* FROM "teams"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]