app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name", "lastname", "email", "role", "owned_teams_id", "gpg_key_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = $1, "email" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-06-11 05:58:37.096464"], ["email", "edgardos.marti@gmail.com"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def gpg_show
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "gpg_keys" ("description", "gpg_public_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "rsa4096"], ["gpg_public_key", "[FILTERED]"], ["created_at", "2024-06-16 01:19:59.287578"], ["updated_at", "2024-06-16 01:19:59.287578"]]
UPDATE "users" SET "updated_at" = $1, "gpg_key_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-06-16 01:19:59.298883"], ["gpg_key_id", "[FILTERED]"], ["id", 4]]
---
  def gpg_update
    @user = User.find(params[:id])
    @user.gpg_key = GpgKey.build(description: "rsa4096", gpg_public_key: params[:pubKey])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "gpg_key_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-06-16 06:26:29.727614"], ["gpg_key_id", "[FILTERED]"], ["id", 4]]
---
  def gpg_destroy
    @user = User.find(params[:id])
    @user.gpg_key=nil
    @user.save